"""
关键字参数
变参
"""

def f_2(**kw):
    f_1(1, 2, 3, None, kw)

def f_1(a, b, c=3, *args, **kw):
    print("a=", a, "b=", b, "c=", c, "*args=", args, "**kw=", kw)

def test_0():
    """
    必选参数、默认参数、可选参数、关键字参数
    如果想给后面的参数传值，前面的参数就必须全部传值
    """
    f_1(1, 2)
    f_1(5, 6, 7, 8, 9, 10)
    f_1(5, 6, 7, 8, 9, 10, d=13, e=15)

def test_1():
    """
    两层变参传递
    不过只能传一层，第一个函数 kw 传给第二个函数时，就会被当作可选参数，
    因为此时 kw 是一个字典
    """
    f_2(name="hello", msg="world")



if __name__ == '__main__':
    test_1()